In [3]:
!pip install --upgrade sqlalchemy
import pandas as pd
from sqlalchemy import create_engine
import psycopg2

Requirement already satisfied: sqlalchemy in c:\users\roman\anaconda3\lib\site-packages (2.0.17)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\roman\anaconda3\lib\site-packages (from sqlalchemy) (2.0.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\roman\anaconda3\lib\site-packages (from sqlalchemy) (4.4.0)

In [4]:
nyc_df = pd.read_csv('/users/roman/Downloads/Metropolitan_Transportation_Authority__MTA__Monthly_Ridership__Beginning_2008.csv')
nyc_df.head()

             Agency Name   Indicator Name   Period Monthly Actual
0  Long Island Rail Road  Total Ridership  2019-06      7,736,345
1  Long Island Rail Road  Total Ridership  2019-05   7,974,945.46
2  Long Island Rail Road  Total Ridership  2019-04    7,724,037.6
3  Long Island Rail Road  Total Ridership  2019-03    7,515,113.2
4  Long Island Rail Road  Total Ridership  2019-02    6,544,350.5

In [26]:
chicago_df = pd.read_csv('/Users/roman/Downloads/CTA_-_Ridership_-_Daily_Boarding_Totals.csv')
chicago_df.head()

  service_date day_type      bus rail_boardings total_rides
0   01/01/2001        U  297,192        126,455     423,647
1   01/02/2001        W  780,827        501,952   1,282,779
2   01/03/2001        W  824,923        536,432   1,361,355
3   01/04/2001        W  870,021        550,011   1,420,032
4   01/05/2001        W  890,426        557,917   1,448,343

In [6]:
nyc_df['month'] = pd.to_datetime(nyc_df['Period']).dt.to_period('M')
nyc_df['city'] = 'New York City'
nyc_df.loc[nyc_df['Agency Name'] == 'NYC transit', 'transportation_type'] = 'metro'
nyc_df.loc[nyc_df['Agency Name'] == 'MTA Bus', 'transportation_type'] = 'bus'
nyc_df.rename(columns={'Monthly Actual': 'ridership_count'}, inplace=True)
nyc_transformed = nyc_df[['month', 'city', 'transportation_type', 'ridership_count']]

In [16]:
nyc_transformed.head()

     month           city transportation_type ridership_count
0  2019-06  New York City                 NaN       7,736,345
1  2019-05  New York City                 NaN    7,974,945.46
2  2019-04  New York City                 NaN     7,724,037.6
3  2019-03  New York City                 NaN     7,515,113.2
4  2019-02  New York City                 NaN     6,544,350.5

In [44]:
chicago_df['service_date'] = pd.to_datetime(chicago_df['service_date'])


chicago_df['month'] = chicago_df['service_date'].dt.to_period('M')


chicago_transformed = chicago_df.loc[:, ['month', 'bus', 'rail_boardings']] \
    .rename(columns={'rail_boardings': 'metro'}) \
    .melt(id_vars='month', value_vars=['bus', 'metro'], var_name='transportation_type', value_name='ridership_count')

# Update transportation_type values
chicago_transformed['transportation_type'] = chicago_transformed['transportation_type'].map({'bus': 'bus', 'metro': 'rail'})

# Update city column
chicago_transformed['city'] = 'Chicago'

# Reorder columns
chicago_transformed = chicago_transformed[['month', 'city', 'transportation_type', 'ridership_count']]

In [45]:
chicago_transformed.head()

     month     city transportation_type ridership_count
0  2001-01  Chicago                 bus         297,192
1  2001-01  Chicago                 bus         780,827
2  2001-01  Chicago                 bus         824,923
3  2001-01  Chicago                 bus         870,021
4  2001-01  Chicago                 bus         890,426

In [46]:
nyc_transformed

       month           city transportation_type ridership_count
0    2019-06  New York City                 NaN       7,736,345
1    2019-05  New York City                 NaN    7,974,945.46
2    2019-04  New York City                 NaN     7,724,037.6
3    2019-03  New York City                 NaN     7,515,113.2
4    2019-02  New York City                 NaN     6,544,350.5
..       ...            ...                 ...             ...
651  2008-05  New York City                 NaN     140,151,863
652  2008-04  New York City                 NaN     136,528,969
653  2008-03  New York City                 NaN     137,148,128
654  2008-02  New York City                 NaN     125,878,662
655  2008-01  New York City                 NaN     130,687,792

[656 rows x 4 columns]

In [47]:
df = pd.concat([nyc_transformed, chicago_transformed])

In [56]:
df['month'] = df['month'].astype(str)
conn = psycopg2.connect(
    host="localhost",
    database="publictransit",
    user="postgres",
    password="Romana123!",
    port="4589"
)
engine = create_engine(r'postgresql://postgres:Romana123!@localhost:4589/publictransit')
df.to_sql('monthly_totals', con=engine, if_exists='replace', index=False)

create_table_query = """
    CREATE TABLE IF NOT EXISTS monthly_totals (
        month DATE,
        city TEXT,
        transportation_type TEXT,
        ridership_count INT
    )
"""

with conn.cursor() as cursor:
    cursor.execute(create_table_query)
    conn.commit()

In [57]:
create_bus_table_query = """
    CREATE TABLE bus_monthly_totals AS
    SELECT *
    FROM monthly_totals
    WHERE transportation_type = 'bus'
"""

create_metro_table_query = """
    CREATE TABLE metro_monthly_totals AS
    SELECT *
    FROM monthly_totals
    WHERE transportation_type = 'metro'
"""

with conn.cursor() as cursor:
    cursor.execute(create_bus_table_query)
    cursor.execute(create_metro_table_query)
    conn.commit()

# Close the connection
conn.close()